Revit 2027 API
FilterableValueProvider.IsDoubleValueSupported Method
 Determines whether the provide can provide a double-precision numeric value for the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDoubleValueSupported(
	Element element
)
Public Function IsDoubleValueSupported (
	element As Element
) As Boolean
public:
bool IsDoubleValueSupported(
	Element^ element
)
member IsDoubleValueSupported :
        element : Element -> bool
Parameters
element Element
 The element to query.
Return Value
Boolean
 True if the provider can return a double-precision numeric value for the given element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace